name: "clip_vision"
platform: "tensorrt_plan"
max_batch_size: 8
input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
  }
]
output [
  {
    name: "image_features"
    data_type: TYPE_FP32
    dims: [512]
  }
]
